# Notebook 1a: Post Tutor Form Data Wrangling
## Calbright Data Analysis Program (2025 Q1)

## Description
This notebook processes Post Tutor Form (aka. Post Session Support Form) entries to identify unique students who received tutoring.

**Input:** Raw Post Tutor Form submissions with potential duplicates and data quality issues <br>
**Process:** Data cleaning, deduplication, validation against gradebook, and manual correction <br>
**Output:** Clean dataset of unique students who received tutoring <br>

## 1 Data Wrangling

### 1.1 Setup and Imports

In [4]:
#Import necessary modules
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### 1.2 Load Data: Post Tutor Form

In [6]:
# the supplied CSV data file is the raw_data directory
ptf_data = pd.read_csv('../raw_data/PTF_2025Q1_id.csv') 
ptf_data.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,1/15/2025,18:00,Sufian,Saiqat,sufian.saiqat@calbrightcollege.org
1,01/17/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
2,01/19/2025,12:00,AnnElyse,Hays,ann.hays@calbrightcollege.org
3,01/22/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
4,01/23/2025,18:00,Scot,Goode,scot.goode@calbrightcollege.org

In [7]:
#Call the info method on the data to see a summary of the data
ptf_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 449 entries, 0 to 448
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                449 non-null    object
 1   Time                447 non-null    object
 2   Student First Name  447 non-null    object
 3   Student Last Name   369 non-null    object
 4   Student Email       435 non-null    object
dtypes: object(5)
memory usage: 17.7+ KB

In [8]:
# check the size of dataset
ptf_data.shape

(449, 5)

**Note:** The Post Tutor Form contains `449` entries representing individual tutoring sessions, not unique students. Multiple sessions per student are expected.

### 1.3 Initial Data Quality Check

#### 1.3.1 Check for Null Values

In [12]:
# Total number of null values in the whole DataFrame
total_nulls = ptf_data.isnull().sum().sum()
print(f"Total number of null entries: {total_nulls}")

# Number of nulls per column
nulls_per_column = ptf_data.isnull().sum()
print("Null entries per column:")
print(nulls_per_column)

Total number of null entries: 98
Null entries per column:
Date                   0
Time                   2
Student First Name     2
Student Last Name     80
Student Email         14
dtype: int64

#### 1.3.2 Check for Duplicates

In [14]:
# Check for duplicate rows
duplicate_rows = ptf_data[ptf_data.duplicated()]

# Print number of duplicates
print(f"Number of duplicate rows: {duplicate_rows.shape[0]}")

# Optionally, display the duplicate rows
# print("Duplicate rows:")
# print(duplicate_rows)

Number of duplicate rows: 41

In [15]:
# Check duplicates based on a specific column (e.g., 'Student Email')
duplicates_by_LID = ptf_data[ptf_data.duplicated(subset='Student Email')]

# Optionally, display the duplicate rows
# print(duplicates_by_LID)
duplicates_by_LID.shape

(292, 5)

In [16]:
# Use pandas' Series method `value_counts` to find any duplicated Student Email
ptf_data['Student Email'].value_counts().head()

lynn.deng@calbrightcollege.org         44
scot.goode@calbrightcollege.org        35
jyoti.dhar@calbrightcollege.org        17
beatrice.tah@calbrightcollege.org      14
johan.sendjaja@calbrightcollege.org    11
Name: Student Email, dtype: int64

In [17]:
# use the `nunique` method to calculate the number of unique values in Student Email
ptf_data['Student Email'].nunique()

156

### 1.4 Data Cleaning

#### 1.4.1 Standardize Email to Lowercase

In [20]:
# Standardize the "Student Email" column entries to lowercase
ptf_data_lower = ptf_data.copy()
ptf_data_lower['Student Email'] = ptf_data_lower['Student Email'].str.lower()
ptf_data_lower.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,1/15/2025,18:00,Sufian,Saiqat,sufian.saiqat@calbrightcollege.org
1,01/17/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
2,01/19/2025,12:00,AnnElyse,Hays,ann.hays@calbrightcollege.org
3,01/22/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
4,01/23/2025,18:00,Scot,Goode,scot.goode@calbrightcollege.org

In [21]:
#Call the info method on the data to see a summary of the data
ptf_data_lower.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 449 entries, 0 to 448
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                449 non-null    object
 1   Time                447 non-null    object
 2   Student First Name  447 non-null    object
 3   Student Last Name   369 non-null    object
 4   Student Email       435 non-null    object
dtypes: object(5)
memory usage: 17.7+ KB

In [22]:
# check the size of dataset
ptf_data_lower.shape

(449, 5)

In [23]:
# Check for duplicate rows
duplicate_rows = ptf_data_lower[ptf_data_lower.duplicated()]

# Print number of duplicates
print(f"Number of duplicate rows: {duplicate_rows.shape[0]}")

# Optionally, display the duplicate rows
# print("Duplicate rows:")
# print(duplicate_rows)

Number of duplicate rows: 41

In [24]:
# Check duplicates based on a specific column (e.g., 'Student Email')
duplicates_by_LID = ptf_data_lower[ptf_data_lower.duplicated(subset='Student Email')]

# Optionally, display the duplicate rows
# print(duplicates_by_LID)
duplicates_by_LID.shape

(300, 5)

In [25]:
# Use pandas' Series method `value_counts` to find any duplicated Student Email
ptf_data_lower['Student Email'].value_counts().head()

lynn.deng@calbrightcollege.org                 44
scot.goode@calbrightcollege.org                35
johan.sendjaja@calbrightcollege.org            21
jyoti.dhar@calbrightcollege.org                17
jocelyn.tabula-maminta@calbrightcollege.org    15
Name: Student Email, dtype: int64

In [26]:
# use the `nunique` method to calculate the number of unique values in Student Email
ptf_data_lower['Student Email'].nunique()

148

#### 1.4.2 Remove Duplicates: Student Email

In [28]:
# Drop duplicate rows based on the "student email" column
ptf_data_unique = ptf_data_lower.drop_duplicates(subset='Student Email')
ptf_data_unique.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,1/15/2025,18:00,Sufian,Saiqat,sufian.saiqat@calbrightcollege.org
1,01/17/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
2,01/19/2025,12:00,AnnElyse,Hays,ann.hays@calbrightcollege.org
6,01/24/2025,17:00,Berenice,Renteria,berenice.renteria@calbrightcollege.org
8,01/24/2025,18:00,Natsnet,Gebrhiwet,natsnet.gebrhiwet@calbrightcollege.org

In [29]:
# Optionally, reset the index
ptf_data_unique = ptf_data_unique.reset_index(drop=True)
ptf_data_unique.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,1/15/2025,18:00,Sufian,Saiqat,sufian.saiqat@calbrightcollege.org
1,01/17/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
2,01/19/2025,12:00,AnnElyse,Hays,ann.hays@calbrightcollege.org
3,01/24/2025,17:00,Berenice,Renteria,berenice.renteria@calbrightcollege.org
4,01/24/2025,18:00,Natsnet,Gebrhiwet,natsnet.gebrhiwet@calbrightcollege.org

In [30]:
#Call the info method on the data to see a summary of the data
ptf_data_unique.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                149 non-null    object
 1   Time                149 non-null    object
 2   Student First Name  149 non-null    object
 3   Student Last Name   115 non-null    object
 4   Student Email       148 non-null    object
dtypes: object(5)
memory usage: 5.9+ KB

In [31]:
# check the size of dataset
ptf_data_unique.shape

(149, 5)

In [32]:
# Total number of null values in the whole DataFrame
total_nulls = ptf_data_unique.isnull().sum().sum()
print(f"Total number of null entries: {total_nulls}")

# Number of nulls per column
nulls_per_column = ptf_data_unique.isnull().sum()
print("Null entries per column:")
print(nulls_per_column)

Total number of null entries: 35
Null entries per column:
Date                   0
Time                   0
Student First Name     0
Student Last Name     34
Student Email          1
dtype: int64

In [33]:
# Display rows with missing "Student Email"
missing_email_rows = ptf_data_unique[ptf_data_unique['Student Email'].isnull()]
print(missing_email_rows)

          Date   Time Student First Name Student Last Name Student Email
12  01/28/2025  14:30             SANDRA    IMERY BONILLA?           NaN

In [34]:
# Check for duplicate rows
duplicate_rows = ptf_data_unique[ptf_data_unique.duplicated()]

# Print number of duplicates
print(f"Number of duplicate rows: {duplicate_rows.shape[0]}")

# Optionally, display the duplicate rows
print("Duplicate rows:")
print(duplicate_rows)

Number of duplicate rows: 0
Duplicate rows:
Empty DataFrame
Columns: [Date, Time, Student First Name, Student Last Name, Student Email]
Index: []

In [35]:
# Check duplicates based on a specific column (e.g., 'Student Email')
duplicates_by_LID = ptf_data_unique[ptf_data_unique.duplicated(subset='Student Email')]
print(duplicates_by_LID)

Empty DataFrame
Columns: [Date, Time, Student First Name, Student Last Name, Student Email]
Index: []

In [36]:
# Use pandas' Series method `value_counts` to find any duplicated Student Email
ptf_data_unique['Student Email'].value_counts().head()

sufian.saiqat@calbrightcollege.org       1
jessica.melendez@calbrightcollege.org    1
yuri.oros@calbrightcollege.org           1
ashley.munoz@calbrightcollege.org        1
yinfang.luo@calbrightcollege.org         1
Name: Student Email, dtype: int64

In [37]:
# use the `nunique` method to calculate the number of unique values in Student Email
ptf_data_unique['Student Email'].nunique()

148

#### 1.4.3 Remove Null Values: Student Email

In [39]:
# Remove rows where 'Student Email' is null
ptf_data_unique_noNull = ptf_data_unique.dropna(subset=['Student Email'])
ptf_data_unique_noNull.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,1/15/2025,18:00,Sufian,Saiqat,sufian.saiqat@calbrightcollege.org
1,01/17/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
2,01/19/2025,12:00,AnnElyse,Hays,ann.hays@calbrightcollege.org
3,01/24/2025,17:00,Berenice,Renteria,berenice.renteria@calbrightcollege.org
4,01/24/2025,18:00,Natsnet,Gebrhiwet,natsnet.gebrhiwet@calbrightcollege.org

In [40]:
#Call the info method on the data to see a summary of the data
ptf_data_unique_noNull.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148 entries, 0 to 148
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                148 non-null    object
 1   Time                148 non-null    object
 2   Student First Name  148 non-null    object
 3   Student Last Name   114 non-null    object
 4   Student Email       148 non-null    object
dtypes: object(5)
memory usage: 6.9+ KB

In [41]:
# check the size of dataset
ptf_data_unique_noNull.shape

(148, 5)

In [42]:
# use the `nunique` method to calculate the number of unique values in Student Email
ptf_data_unique_noNull['Student Email'].nunique()

148

**Result:** `148` unique students identified from `449` tutoring sessions

### 1.5 Data Validation: Student Email Validation Against Gradebook

Validate the Post Tutor Form "Student Email" entries by matching them with the GradeBook "Learner Identifier" entries. Manually check any unmatched entries for typos, if applicable.

#### 1.5.1 Load Gradebook Data for Validation

In [47]:
# the supplied CSV data file is the raw_data directory
gb_data_500 = pd.read_csv('../raw_data/BUS500_2025-04-07 12_10 PM PT.csv') 
gb_data_501 = pd.read_csv('../raw_data/BUS501_2025-04-07 12_19 PM PT.csv')

In [48]:
#Call the info method on the data to see a summary of the data
gb_data_500.info() 
gb_data_501.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2659 entries, 0 to 2658
Data columns (total 11 columns):
 #   Column                                  Non-Null Count  Dtype
---  ------                                  --------------  -----
 0   Learner Last Name                       2659 non-null   object
 1   Learner First Name                      2656 non-null   object
 2   Learner Identifier                      2659 non-null   object
 3   DATA ANALYSIS: Terminology              2659 non-null   object
 4   DATA ANALYSIS: Spreadsheets             2659 non-null   object
 5   DATA ANALYSIS: Basic SQL Queries        2659 non-null   object
 6   DATA ANALYSIS: Presentation Skills      2659 non-null   object
 7   DATA ANALYSIS: Research                 2659 non-null   object
 8   DATA ANALYSIS: Data Validity            2659 non-null   object
 9   DATA ANALYSIS: Mathematical Principles  2659 non-null   object
 10  Introduction to Data Analysis Program   2659 non-null   object
dtypes: object(11)
memory usage: 228.6+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 521 entries, 0 to 520
Data columns (total 9 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   Learner Last Name                        521 non-null    object
 1   Learner First Name                       520 non-null    object
 2   Learner Identifier                       521 non-null    object
 3   DATA ANALYSIS: Intermediate SQL Queries  521 non-null    object
 4   DATA ANALYSIS: Data Ethics               521 non-null    object
 5   DATA ANALYSIS: Data Presentation Skills  521 non-null    object
 6   DATA ANALYSIS: Professional Learning     521 non-null    object
 7   DATA ANALYSIS: Durable Skills            521 non-null    object
 8   Introduction to Data Analysis Program    521 non-null    object
dtypes: object(9)
memory usage: 36.8+ KB

In [49]:
# check the size of original dataset
gb_data_500.shape, gb_data_501.shape

((2659, 11), (521, 9))

**Checkpoint**: The "Learner Identifier" column in both the 500 and 501 datasets has no null values.

#### 1.5.2 Merge Gradebook Data

In [52]:
# Perform outer join on the 'Learner Identifier' column
gb_data_500_501 = pd.merge(gb_data_500, gb_data_501, on='Learner Identifier', how='outer')
gb_data_500_501.head()

,Learner Last Name_x,Learner First Name_x,Learner Identifier,DATA ANALYSIS: Terminology,DATA ANALYSIS: Spreadsheets,DATA ANALYSIS: Basic SQL Queries,DATA ANALYSIS: Presentation Skills,DATA ANALYSIS: Research,DATA ANALYSIS: Data Validity,DATA ANALYSIS: Mathematical Principles,Introduction to Data Analysis Program_x,Learner Last Name_y,Learner First Name_y,DATA ANALYSIS: Intermediate SQL Queries,DATA ANALYSIS: Data Ethics,DATA ANALYSIS: Data Presentation Skills,DATA ANALYSIS: Professional Learning,DATA ANALYSIS: Durable Skills,Introduction to Data Analysis Program_y
0,Hawker,SHARI,shari.hawker@calbrightcollege.org,Incomplete,Incomplete,Incomplete,Incomplete,Incomplete,Incomplete,Incomplete,0%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,KARKI,RISHTA,rishta.karki@calbrightcollege.org,Complete on 2024-08-10T15:43:03.169,Complete on 2024-08-11T22:54:32.014,Incomplete,Incomplete,Incomplete,Incomplete,Incomplete,14%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Sandoval,George,george.sandoval@calbrightcollege.org,Complete on 2024-09-02T12:37:20.540,Complete on 2024-10-02T21:05:47.423,Complete on 2024-12-12T19:39:04.199,Complete on 2024-12-21T12:54:03.313,Complete on 2025-02-13T11:20:26.987,Complete on 2025-03-16T10:56:53.575,Complete on 2025-03-18T19:45:36.223,42%,Sandoval,George,Incomplete,Incomplete,Incomplete,Incomplete,Incomplete,42%
3,Salgado,Jairo Flores,jairo.floressalgado@calbrightcollege.org,Complete on 2024-07-27T13:06:18.921,Complete on 2024-08-07T21:35:59.760,Complete on 2024-07-28T14:04:51.595,Complete on 2024-08-07T22:27:31.467,Complete on 2024-08-25T00:06:59.396,Complete on 2024-08-25T00:15:04.042,Complete on 2024-08-25T00:27:45.474,98%,Salgado,Jairo Flores,Complete on 2024-09-18T08:44:26.195,Complete on 2024-09-18T10:46:37.043,Incomplete,Complete on 2024-09-17T22:58:14.796,Complete on 2024-09-18T11:08:19.710,98%
4,Massio-Voelkert,Michele,michele.massiovoelkert@calbrightcollege.org,Incomplete,Incomplete,Incomplete,Incomplete,Incomplete,Incomplete,Incomplete,0%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [53]:
#Call the info method on the data to see a summary of the data
gb_data_500_501.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2663 entries, 0 to 2662
Data columns (total 19 columns):
 #   Column                                   Non-Null Count  Dtype
---  ------                                   --------------  -----
 0   Learner Last Name_x                      2659 non-null   object
 1   Learner First Name_x                     2656 non-null   object
 2   Learner Identifier                       2663 non-null   object
 3   DATA ANALYSIS: Terminology               2659 non-null   object
 4   DATA ANALYSIS: Spreadsheets              2659 non-null   object
 5   DATA ANALYSIS: Basic SQL Queries         2659 non-null   object
 6   DATA ANALYSIS: Presentation Skills       2659 non-null   object
 7   DATA ANALYSIS: Research                  2659 non-null   object
 8   DATA ANALYSIS: Data Validity             2659 non-null   object
 9   DATA ANALYSIS: Mathematical Principles   2659 non-null   object
 10  Introduction to Data Analysis Program_x  2659 non-null   object
 11  Learner Last Name_y                      521 non-null    object
 12  Learner First Name_y                     520 non-null    object
 13  DATA ANALYSIS: Intermediate SQL Queries  521 non-null    object
 14  DATA ANALYSIS: Data Ethics               521 non-null    object
 15  DATA ANALYSIS: Data Presentation Skills  521 non-null    object
 16  DATA ANALYSIS: Professional Learning     521 non-null    object
 17  DATA ANALYSIS: Durable Skills            521 non-null    object
 18  Introduction to Data Analysis Program_y  521 non-null    object
dtypes: object(19)
memory usage: 416.1+ KB

In [54]:
# check the size of original dataset
gb_data_500_501.shape

(2663, 19)

In [55]:
# Total number of null values in the whole DataFrame
total_nulls = gb_data_500_501.isnull().sum().sum()
print(f"Total number of null entries: {total_nulls}")

# Number of nulls per column
nulls_per_column = gb_data_500_501.isnull().sum()
print("Null entries per column:")
print(nulls_per_column)

Total number of null entries: 17180
Null entries per column:
Learner Last Name_x                           4
Learner First Name_x                          7
Learner Identifier                            0
DATA ANALYSIS: Terminology                    4
DATA ANALYSIS: Spreadsheets                   4
DATA ANALYSIS: Basic SQL Queries              4
DATA ANALYSIS: Presentation Skills            4
DATA ANALYSIS: Research                       4
DATA ANALYSIS: Data Validity                  4
DATA ANALYSIS: Mathematical Principles        4
Introduction to Data Analysis Program_x       4
Learner Last Name_y                        2142
Learner First Name_y                       2143
DATA ANALYSIS: Intermediate SQL Queries    2142
DATA ANALYSIS: Data Ethics                 2142
DATA ANALYSIS: Data Presentation Skills    2142
DATA ANALYSIS: Professional Learning       2142
DATA ANALYSIS: Durable Skills              2142
Introduction to Data Analysis Program_y    2142
dtype: int64

In [56]:
# use the `nunique` method to calculate the number of unique values in Student Email
gb_data_500_501['Learner Identifier'].nunique()

2663

**Checkpoint**: The "Learner Identifier" column in the merged 500 and 501 datasets contains only unique values and no duplicates.

#### 1.5.3 Identify Matched and Unmatched Student Emails

In [59]:
# Always copy to avoid modifying original data
df1 = ptf_data_unique_noNull.copy()
df2 = gb_data_500_501.copy()

In [60]:
# Ensure both columns are of the same type (string)
df1['Student Email'] = df1['Student Email'].astype(str)
df2['Learner Identifier'] = df2['Learner Identifier'].astype(str)

# Extract matching rows (in df1 where "Student Email" exists in df2["Learner Identifier"])
df1_matched = df1[df1['Student Email'].isin(df2['Learner Identifier'])]

# Extract non-matching rows (in df1 where "Student Email" does NOT exist in df2["Learner Identifier"])
df1_unmatched = df1[~df1['Student Email'].isin(df2['Learner Identifier'])]

In [61]:
# Save transformed version safely
ptf_data_unique_noNull_matched= df1_matched.copy()
ptf_data_unique_noNull_matched.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,1/15/2025,18:00,Sufian,Saiqat,sufian.saiqat@calbrightcollege.org
1,01/17/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
2,01/19/2025,12:00,AnnElyse,Hays,ann.hays@calbrightcollege.org
3,01/24/2025,17:00,Berenice,Renteria,berenice.renteria@calbrightcollege.org
4,01/24/2025,18:00,Natsnet,Gebrhiwet,natsnet.gebrhiwet@calbrightcollege.org

In [62]:
# Save transformed version safely
ptf_data_unique_noNull_unmatched= df1_unmatched.copy()
ptf_data_unique_noNull_unmatched.head()

,Date,Time,Student First Name,Student Last Name,Student Email
11,01/27/2025,18:00,Jocelyn,Tabula Maminta?,jocelyn.tabula-maminta@calbrightcollege.org
28,2/21/2025,17:30,Brenda,Mullins,brenda.mullins73@calbrightcollege.org
30,02/24/2025,18:00,Djenane,Louis-Jacques,d.louis-jacques@calbrightcollege.org
34,02/28/2025,17:30,Simon,Tan,simon.tan@calbrightcollege.org
35,1/2/2025,10:00,Michael,Cabradilla,michael.cabradilla@calbrightcollege.org

In [63]:
# check the size of dataset
ptf_data_unique_noNull.shape, ptf_data_unique_noNull_matched.shape, ptf_data_unique_noNull_unmatched.shape

((148, 5), (135, 5), (13, 5))

**Result:** 
- `135` students matched with gradebook (valid student emails)
- `13` students unmatched (require manual verification)

**Note:** Unmatched entries were primarily due to:
- Students not in gradebook system
- Personal emails (non-Calbright student emails)
- Email typos (e.g., missing letters)

#### 1.5.4 Export Data for Manual Validation

In [66]:
# Save to a specific folder
ptf_data_unique_noNull.to_csv("../data_wrangling_ouput/ptf_2025Q1_unique_noNull.csv", index=False)
ptf_data_unique_noNull_matched.to_csv("../data_wrangling_ouput/ptf_2025Q1_unique_noNull_matched.csv", index=False)
ptf_data_unique_noNull_unmatched.to_csv("../data_wrangling_ouput/ptf_2025Q1_unique_noNull_unmatched.csv", index=False)

**Note:** The unmatched emails were exported to CSV, manually reviewed against the gradebook, and corrected where possible.

### 1.6 Reconstruct Final Post Tutor Form Dataset with Corrected Student Emails

#### 1.6.1 Import Manually Corrected Post Tutor Form Data

In [70]:
# the supplied CSV data file is the raw_data directory
ptf_data_unique_unmatched_corrected = pd.read_csv('../data_wrangling_ouput/ptf_2025Q1_unique_unmatched_corrected.csv') 
ptf_data_unique_unmatched_corrected.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,01/27/2025,18:00,Jocelyn,Tabula Maminta?,jocelyn.tabula-maminta@calbrightcollege.org
1,2/21/2025,17:30,Brenda,Mullins,NaN
2,02/24/2025,18:00,Djenane,Louis-Jacques,NaN
3,02/28/2025,17:30,Simon,Tan,simon.tan@calbrightcollege.org
4,1/2/2025,10:00,Michael,Cabradilla,NaN

In [71]:
# check the size of dataset
ptf_data_unique_unmatched_corrected.shape

(13, 5)

In [72]:
#Call the info method on the data to see a summary of the data
ptf_data_unique_unmatched_corrected.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                13 non-null     object
 1   Time                13 non-null     object
 2   Student First Name  13 non-null     object
 3   Student Last Name   11 non-null     object
 4   Student Email       8 non-null      object
dtypes: object(5)
memory usage: 648.0+ bytes

In [73]:
# use the `nunique` method to calculate the number of unique values in Student Email
ptf_data_unique_unmatched_corrected['Student Email'].nunique()

8

In [74]:
# Total number of null values in the whole DataFrame
total_nulls = ptf_data_unique_unmatched_corrected.isnull().sum().sum()
print(f"Total number of null entries: {total_nulls}")

# Number of nulls per column
nulls_per_column = ptf_data_unique_unmatched_corrected.isnull().sum()
print("Null entries per column:")
print(nulls_per_column)

Total number of null entries: 7
Null entries per column:
Date                  0
Time                  0
Student First Name    0
Student Last Name     2
Student Email         5
dtype: int64

In [75]:
# Display rows with missing "Student Email"
missing_email_rows = ptf_data_unique_unmatched_corrected[ptf_data_unique_unmatched_corrected['Student Email'].isnull()]
print(missing_email_rows)

          Date   Time Student First Name Student Last Name Student Email
1    2/21/2025  17:30             Brenda           Mullins           NaN
2   02/24/2025  18:00            Djenane     Louis-Jacques           NaN
4     1/2/2025  10:00            Michael        Cabradilla           NaN
11   3/30/2025  19:00             Romina            Martin           NaN
12  03/22/2025  13:30   Cristaldo Campos               NaN           NaN

**Note:** The `13` unmatched student emails were manually reviewed and corrected where possible against gradebook student emails. During the process, `5` students were found to not exist in the gradebook system and were manually marked as Null, and were excluded in the next section **1.6.2 Remove Invalid Students**.

#### 1.6.2 Remove Invalid Students

In [78]:
# Remove rows where 'Student Email' is null
ptf_data_unique_unmatched_corrected_noNull = ptf_data_unique_unmatched_corrected.dropna(subset=['Student Email'])
ptf_data_unique_unmatched_corrected_noNull.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,01/27/2025,18:00,Jocelyn,Tabula Maminta?,jocelyn.tabula-maminta@calbrightcollege.org
3,02/28/2025,17:30,Simon,Tan,simon.tan@calbrightcollege.org
5,1/2/2025,10:30,Priti,Burnman,priti.burman@calbrightcollege.org
6,1/28/2025,10:00,Natsnet Mulubrhan,Gebrhiwet,natsnet.gebrhiwet@calbrightcollege.org
7,01/16/2025,21:00,Janita Digins,NaN,janita.diggins@calbrightcollege.org

In [79]:
#Call the info method on the data to see a summary of the data
ptf_data_unique_unmatched_corrected_noNull.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 0 to 10
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                8 non-null      object
 1   Time                8 non-null      object
 2   Student First Name  8 non-null      object
 3   Student Last Name   7 non-null      object
 4   Student Email       8 non-null      object
dtypes: object(5)
memory usage: 384.0+ bytes

In [80]:
# check the size of dataset
ptf_data_unique_unmatched_corrected_noNull.shape

(8, 5)

In [81]:
# use the `nunique` method to calculate the number of unique values in Student Email
ptf_data_unique_unmatched_corrected_noNull['Student Email'].nunique()

8

#### 1.6.3 Combine Matched and Corrected Post Tutor Form Data

In [83]:
# Combine matched and unmached data by stacking rows (same columns)
ptf_data_combined = pd.concat([ptf_data_unique_noNull_matched, ptf_data_unique_unmatched_corrected_noNull], ignore_index=True)
ptf_data_combined.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,1/15/2025,18:00,Sufian,Saiqat,sufian.saiqat@calbrightcollege.org
1,01/17/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
2,01/19/2025,12:00,AnnElyse,Hays,ann.hays@calbrightcollege.org
3,01/24/2025,17:00,Berenice,Renteria,berenice.renteria@calbrightcollege.org
4,01/24/2025,18:00,Natsnet,Gebrhiwet,natsnet.gebrhiwet@calbrightcollege.org

In [84]:
#Call the info method on the data to see a summary of the data
ptf_data_combined.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 143 entries, 0 to 142
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                143 non-null    object
 1   Time                143 non-null    object
 2   Student First Name  143 non-null    object
 3   Student Last Name   110 non-null    object
 4   Student Email       143 non-null    object
dtypes: object(5)
memory usage: 5.7+ KB

In [85]:
# check the size of dataset
ptf_data_combined.shape

(143, 5)

In [86]:
# use the `nunique` method to calculate the number of unique values in Student Email
ptf_data_combined['Student Email'].nunique()

137

**Note:** The corrected, unmatched data may contain duplicates when combined with the matched data (e.g., if student email typos were corrected to match gradebook entries).

#### 1.6.4 Final Deduplication: Student Email

In [89]:
# Drop duplicate rows based on the "student email" column
ptf_data_clean = ptf_data_combined.drop_duplicates(subset='Student Email')
ptf_data_clean.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,1/15/2025,18:00,Sufian,Saiqat,sufian.saiqat@calbrightcollege.org
1,01/17/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
2,01/19/2025,12:00,AnnElyse,Hays,ann.hays@calbrightcollege.org
3,01/24/2025,17:00,Berenice,Renteria,berenice.renteria@calbrightcollege.org
4,01/24/2025,18:00,Natsnet,Gebrhiwet,natsnet.gebrhiwet@calbrightcollege.org

In [90]:
# Optionally, reset the index
ptf_data_clean = ptf_data_clean.reset_index(drop=True)
ptf_data_clean.head()

,Date,Time,Student First Name,Student Last Name,Student Email
0,1/15/2025,18:00,Sufian,Saiqat,sufian.saiqat@calbrightcollege.org
1,01/17/2025,18:30,Scot,Goode,scot.goode@calbrightcollege.org
2,01/19/2025,12:00,AnnElyse,Hays,ann.hays@calbrightcollege.org
3,01/24/2025,17:00,Berenice,Renteria,berenice.renteria@calbrightcollege.org
4,01/24/2025,18:00,Natsnet,Gebrhiwet,natsnet.gebrhiwet@calbrightcollege.org

In [91]:
#Call the info method on the data to see a summary of the data
ptf_data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 137 entries, 0 to 136
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Date                137 non-null    object
 1   Time                137 non-null    object
 2   Student First Name  137 non-null    object
 3   Student Last Name   105 non-null    object
 4   Student Email       137 non-null    object
dtypes: object(5)
memory usage: 5.5+ KB

In [92]:
# check the size of dataset
ptf_data_clean.shape

(137, 5)

In [93]:
# use the `nunique` method to calculate the number of unique values in Student Email
ptf_data_clean['Student Email'].nunique()

137

---
## 2 Data Export and Summary

In [95]:
# Save to a specific folder
ptf_data_clean.to_csv("../data_wrangling_ouput/PTF_2025Q1_id_clean.csv", index=False)

### 2.1 Summary
- **Total tutoring sessions recorded:** `449`
- **Unique students identified:** `148` (before validation)
- **Students validated against gradebook:** `137`
- **Final dataset:** `137` unique students with valid emails

### 2.2 Summary of Outputs:
- `PTF_2025Q1_id_clean.csv`: Date, Time, Student First Name, Student Last Name, and Student Email for each unique student who received tutoring.
- **Note:** This file is used in Notebook 1b to identify tutored students in the gradebook data.